{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,3,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"lstm_LSTM1","class_name":"LSTM","config":{"units":10,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":738,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["lstm_LSTM1",0,0,{}]]]},{"name":"activation_Activation1","class_name":"Activation","config":{"activation":"softmax","name":"activation_Activation1","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["activation_Activation1",0,0]]},"keras_version":"tfjs-layers 0.8.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm_LSTM1/kernel","shape":[1,40],"dtype":"float32"},{"name":"lstm_LSTM1/recurrent_kernel","shape":[10,40],"dtype":"float32"},{"name":"lstm_LSTM1/bias","shape":[40],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[10,738],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[738],"dtype":"float32"}]}]}