{"modelTopology":{"class_name":"Sequential","config":[{"class_name":"InputLayer","config":{"batch_input_shape":[null,3,1],"dtype":"float32","sparse":false,"name":"input1"}},{"class_name":"LSTM","config":{"units":1,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false,"name":"lstm_LSTM1","trainable":true}},{"class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true}},{"class_name":"Dense","config":{"units":1232,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}}],"keras_version":"tfjs-layers 0.8.1","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm_LSTM1/kernel","shape":[1,4],"dtype":"float32"},{"name":"lstm_LSTM1/recurrent_kernel","shape":[1,4],"dtype":"float32"},{"name":"lstm_LSTM1/bias","shape":[4],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[1],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[1,1232],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1232],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[1],"dtype":"float32"}]}]}